In [1]:
import pandas as pd

In [2]:
apel = pd.Series([5,2,0,1])

In [3]:
jeruk = pd.Series([0,3,8,2], index=[1,2,3,4])

In [6]:
apel[1]
jeruk[2]

3

In [8]:
df1 = pd.DataFrame([5,2,0,1], columns=['apel'])
apel

0    5
1    2
2    0
3    1
dtype: int64

In [9]:
dict1 = {
    'apel': [5,2,0,1],
    'jeruk': [0,3,8,2]
}
df1 = pd.DataFrame(dict1)
df1

   apel  jeruk
0     5      0
1     2      3
2     0      8
3     1      2

In [10]:
# untuk menghitung jumblah data
df1.count()

apel     4
jeruk    4
dtype: int64

In [11]:
# untuk menghitung jumblah keseluruhan semua nilai
df1.sum()

apel      8
jeruk    13
dtype: int64

In [12]:
# fungsi describe() yg dpt menampilkan statistik singat tentang dataset
df1.describe()

           apel    jeruk
count  4.000000  4.00000
mean   2.000000  3.25000
std    2.160247  3.40343
min    0.000000  0.00000
25%    0.750000  1.50000
50%    1.500000  2.50000
75%    2.750000  4.25000
max    5.000000  8.00000

In [ ]:
# mengambil subset dari dataframe
# dgn series:
apel = df1.apel
# atau
# apel = df1.['apel']
# jeruk_apel = df1['jeruk','apel']

In [13]:
df1[0:2]

   apel  jeruk
0     5      0
1     2      3

In [14]:
df1[2:]

   apel  jeruk
2     0      8
3     1      2

In [15]:
# perbandingan di dataframe
df1['jeruk']>2

0    False
1     True
2     True
3    False
Name: jeruk, dtype: bool

In [16]:
# menampilkan baris-baris yg memenuhi syarat(true) ke layar
df1[df1['jeruk']>2]

   apel  jeruk
1     2      3
2     0      8

In [18]:
# head() dipakai utk membaca beberapa baris pertama saja.
df1.head(2)

   apel  jeruk
0     5      0
1     2      3

In [19]:
# ini dinamakan transpose
df1.T

       0  1  2  3
apel   5  2  0  1
jeruk  0  3  8  2

In [23]:
# mengambil data dgn operator iloc(dgn angka) atau dgn loc(dgn nama index)
df1.iloc[3]

apel     1
jeruk    2
Name: 3, dtype: int64

In [24]:
df1.iloc[[1,3]]

   apel  jeruk
1     2      3
3     1      2

In [39]:
df2 = pd.DataFrame(dict1, index=['a','b','c','d'])
df2

   apel  jeruk
a     5      0
b     2      3
c     0      8
d     1      2

In [28]:
# mengambil data dgn operator loc(dgn nama index)
df2.loc['c']

apel     0
jeruk    8
Name: c, dtype: int64

In [36]:
# fungsi drop() menghapus baris dgn index yang di sebutkan
df3 = df2.drop('b')
df3

   apel
a     5
b     2
c     0
d     1

In [34]:
"""kita  bisa menambahkan opsi inplance=True agar operasi drop() terhadap
DataFrame langsung mengubah isi DataFrame aslinya"""
# df2.drop('b', inplace=True)

'kita  bisa menambahkan opsi inplance=True agar operasi drop() terhadap\nDataFrame langsung mengubah isi DataFrame aslinya'

In [43]:
# cara menghapus seluruh isi sebuah kolom dgn axis=
df4 = df2.drop('jeruk', axis=1)
df4

   apel
a     5
b     2
c     0
d     1

In [49]:
""" fungsi duplicated() yng disediakan pandas bisa sangat membantu untuk mencari 
data-data yg muncul lebih dari sekali di DataFrame"""
df5 = pd.DataFrame([1,2,2,3,4,5,5,5,6,7], columns=['nilai'])

df5.duplicated()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7     True
8    False
9    False
dtype: bool

In [51]:
# fungsi drop_duplicates() utk menghapus data duplikat
df6 = df5.drop_duplicates(keep='first')
""" 
fungsi keep='first' digunakan utk memberitahu pandas bahwa 
data duplikat selain yang paling awal ditemukan di dalam DataFrame.
fungsi keep-'last' akan menghapus semua baris duplikat selain baris 
yg terakhir ditemukan.
"""

df6

   nilai
0      1
1      2
3      3
4      4
5      5
8      6
9      7

In [53]:
"""
hanya ingin membuang duplikasi dari satu kolom tertentu
(bila DataFrame memiliki banyak kolom), maka nama kolom harus di sebut
"""
df7 = df5.drop_duplicates(['nilai'], keep='first')
df7

   nilai
0      1
1      2
3      3
4      4
5      5
8      6
9      7

In [55]:
df8 = pd.DataFrame([1,2,None,4,5,None], columns=['nilai'])
df8

   nilai
0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
5    NaN

In [56]:
# NaN adalah not a number
"""
jika ingin membuang data yg kosong, mengunakan fungsi dropna()
"""
df9 = df8.dropna()
df9

   nilai
0    1.0
1    2.0
3    4.0
4    5.0

In [57]:
""" 
funsi fillna() akan mengisi semua data yg kosong dgn angka yg dimau
"""
df10 = df8.fillna(999)
df10

   nilai
0    1.0
1    2.0
2  999.0
3    4.0
4    5.0
5  999.0

In [4]:
""" 
fungsi loc() digunakan utk keperluan if-else
"""
df1 = pd.DataFrame([1,2,3,4,5,6,7,8], columns=['nilai'])
df1.loc[df1['nilai'] >= 5, "kelulusan"] = 'Lulus'
df1.loc[df1['nilai'] < 5, "kelulusan"] = 'Gagal'
df1

   nilai kelulusan
0      1     Gagal
1      2     Gagal
2      3     Gagal
3      4     Gagal
4      5     Lulus
5      6     Lulus
6      7     Lulus
7      8     Lulus

In [ ]:
# df1 = pd.read_csv("C:\\nama_file.csv")
# untuk membaca file

# df1 = pd.read_csv("C:\\nama_file.csv", usecol=range(5))
# untuk menentukan sendiri jumblah kolom yang di ambil

# df1 = pd.read_csv("C:\\nama_file.csv", header=None)
# utk tdk menganggap baris pertama sebagai header, namun sebagai data biasa

# df1 = pd.read_csv("C:\\nama_file.csv", names=['a','b','c'])
# utk menentukan sendiri nama kolom dalam DataFrame

# df1 = pd.read_csv("C:\\nama_file.csv", names=['a','b','c'], index_cool='a')
# bilamana ingin menggunakan salah satu kolom di dalam DataFrame sebagai index

""" 
pandas secara otomatis akan berhenti membaca file bilamenemui file yg isinya tdk konsisten,
misalnya ada baris yg jumlah kolomnya tdk sama dgn baris-baris lainnya.
"""
# df1 = pd.read_csv("C:\\nama_file.csv", error_bad_lines="False")


""" 
utk mencegah proses pembacaan file yg terlalu panjang atau tdk cukup
masuk ke memory komputer yg tersedia.
"""
# df1 = pd.read_csv("C:\\nama_file.csv", names=['a','b','c'], nrows=1000)

Join
Pandas juga memungkinkan kita melakukan join dua DataFrame, dengan cara yang mirip dengan SQL. Cara pertama adalah dengan menjumlahkan dua DataFrame dengan menggunakan index sebagai acuannya.

In [3]:
""" 
terdapat dua buah DataFrame, yaitu df1 dan df2 yg 
dijumblahkan sehingga menghasilkan df3
"""
df1 = pd.DataFrame([4,2,5,1], columns=['nanas'], index=[1,2,3,4])
df2 = pd.DataFrame([1,3,9,6], columns=['nanas'], index=[2,3,4,5])
df3 = df2 + df1
df3

   nanas
1    NaN
2    3.0
3    8.0
4   10.0
5    NaN

In [19]:
df_kategori = pd.read_csv('kategori.csv', names=['kategori_id','kategori'], index_col=['kategori_id'])

In [2]:
df_menu = pd.read_csv('menu.csv', names=['produk','kategori_id'])

In [21]:
# inner join
# funsi merge() yg dapat melakukan join/inner join
df_join = pd.merge(df_menu, df_kategori, on='kategori_id')
df_join

                produk  kategori_id  kategori
0            soto ayam            1   Makanan
1  nasi goreng seafood            1   Makanan
2         sate kambing            1   Makanan
3           bakso sapi            1   Makanan
4           limun soda            2   Minuman
5            kopi susu            2   Minuman
6          air mineral            2   Minuman
7         es the manis            2   Minuman
8          tempe bacem            3  Tambahan
9              kerupuk            3  Tambahan

outer join
yaitu  ketika semua baris akan  ditampilkan  meskipun tdk ada pasangannya

In [22]:
df_join = pd.merge(df_menu, df_kategori, on='kategori_id', how='outer')
df_join

                 produk  kategori_id  kategori
0             soto ayam            1   Makanan
1   nasi goreng seafood            1   Makanan
2          sate kambing            1   Makanan
3            bakso sapi            1   Makanan
4            limun soda            2   Minuman
5             kopi susu            2   Minuman
6           air mineral            2   Minuman
7          es the manis            2   Minuman
8           tempe bacem            3  Tambahan
9               kerupuk            3  Tambahan
10                  NaN            4   Kudapan

Mengurutkan data
operasi sorting(pengurutan) adalah salah satu operasi yg sangat sering dilakukan dalam proses analisis.
Dalama database SQL, perintah yg dipakai adalah SORT BY. dalam pandas, kita gunakan fungsi sort_valuas() 
dan sort_index.

In [3]:
# ini akan di urutkan sesuai alfabetik(dari A dan Z)
df_menu.sort_values(by='produk')

                produk  kategori_id
5          air mineral            2
6           bakso sapi            1
8         es the manis            2
9              kerupuk            3
4            kopi susu            2
3           limun soda            2
1  nasi goreng seafood            1
2         sate kambing            1
0            soto ayam            1
7          tempe bacem            3

In [6]:
# ini akan di urutkan (dari Z dan A)
df_menu.sort_values(by='produk', ascending=False)

                produk  kategori_id
7          tempe bacem            3
0            soto ayam            1
2         sate kambing            1
1  nasi goreng seafood            1
3           limun soda            2
4            kopi susu            2
9              kerupuk            3
8         es the manis            2
6           bakso sapi            1
5          air mineral            2

                produk  kategori_id
0            soto ayam            1
1  nasi goreng seafood            1
2         sate kambing            1
3           limun soda            2
4            kopi susu            2
5          air mineral            2
6           bakso sapi            1
7          tempe bacem            3
8         es the manis            2
9              kerupuk            3

In [10]:
# menentukan  ranking isi nilai di dalam data.
df1 = pd.DataFrame([4,5,2,7,1,8], columns=['nilai'])
df1['ranking'] = df1['nilai'].rank()
df1

   nilai  ranking
0      4      3.0
1      5      4.0
2      2      2.0
3      7      5.0
4      1      1.0
5      8      6.0

In [30]:
# Binning
kelompok_usia = [15,20,55,100]
kelompok_usia_label = ['remaja', 'dewasa', 'lanjut usia']
responden = [17,18,19,21,68,16,72,23,55,27,28,32,33,34,47,38,40,42,48,50,55,61,66,76]

In [31]:
binning = pd.cut(responden, kelompok_usia, labels=kelompok_usia_label, include_lowest=True)
binning

['remaja', 'remaja', 'remaja', 'dewasa', 'lanjut usia', ..., 'dewasa', 'dewasa', 'lanjut usia', 'lanjut usia', 'lanjut usia']
Length: 24
Categories (3, object): ['remaja' < 'dewasa' < 'lanjut usia']

In [32]:
# kita bisa gunakan fungsi value_counts() utk menghitung isi masing-masing kelompok usia
pd.value_counts(binning)

dewasa         15
lanjut usia     5
remaja          4
dtype: int64

In [35]:
codes = binning.codes
dict1 = {'usia': responden, 'kelompok': codes}
df1 = pd.DataFrame(dict1, columns=['usia','kelompok'])
df1.head(5)

   usia  kelompok
0    17         0
1    18         0
2    19         0
3    21         1
4    68         2